Documents/ЛБ_ВедомостьРКОПоЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ВедомостьРКОПоЗарплате</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗУП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЛБ_СтатусыВедомостиПоЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыВедомостиПоЗарплате</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РасходныйКассовыйОрдер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРКО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомераРКО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдано</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КорпоративныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзLX</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_ВедомостьРКОПоЗарплате/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтделениеПриИзменении(Элемент)
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Отделение", Отделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Отделение));
	
	ПолучитьСуммыСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Статус", Статус, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Статус));
	
	
	ПолучитьСуммыСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ТекСтр = Элементы.Сотрудники.ТекущиеДанные; 
	Если ТекСтр <> Неопределено Тогда
		Если ТекСтр.Статус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыВедомостиПоЗарплате.Проект") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отделение", 	ТекСтр.Отделение);
			ПараметрыФормы.Вставить("Получатель", 	ТекСтр.Сотрудник); 
			ПараметрыФормы.Вставить("Сумма", 		ТекСтр.КВыдаче);
			ПараметрыФормы.Вставить("ВедомостьЗП",  Элементы.Список.ТекущиеДанные.Ссылка);
			
			ОткрытьФорму("Документ.ЛБ_ВедомостьРКОПоЗарплате.ФОрма.ФормаВыбораЛомбарда",		ПараметрыФормы); 
		КонецЕсли;
	КонецЕсли;
	ОбновитьСотрудников(); 
	ПолучитьСуммыСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтправку(Команда) 
	ТекСтр = Элементы.Сотрудники.ТекущиеДанные; 
	Если ТекСтр <> Неопределено Тогда
		
		ОтменитьОтправкуНаСервере(ТекСтр.РКО);
		
		Элементы.Список.Обновить();
		ОбновитьСотрудников();  
		ПолучитьСуммыСпискаНаСервере();

		
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьСотрудников()
	ТекСтрочка = Элементы.Список.ТекущиеДанные; 
	Если ТекСтрочка <> Неопределено Тогда
		ПоказатьСотрудников(ТекСтрочка.Ссылка); 
	КонецЕсли;	
	
	Элементы.СотрудникиКВыдаче.ТекстПодвала = Сотрудники.Итог("КВыдаче");
	Элементы.СотрудникиВыдано.ТекстПодвала = Сотрудники.Итог("Выдано");

КонецПроцедуры

Процедура ОтменитьОтправкуНаСервере(РКО)
	Если ЗначениеЗаполнено(РКО) Тогда
		Если НЕ РКО.Проведен и НЕ РКО.ПометкаУдаления Тогда
			ОБ = РКО.ПолучитьОбъект();
			Об.УстановитьПометкуУдаления(Истина); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаВариантПриИзменении(Элемент)
	ИзменитьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаПриИзменении(Элемент)
	ИзменитьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериод()
	НачПериода=НачалоДня(ВыборПериода.ДатаНачала);
	КонПериода=КонецДня(ВыборПериода.ДатаОкончания);
КонецПроцедуры	

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтр = Элементы.Список.ТекущиеДанные; 
	Если ТекСтр <> Неопределено Тогда
		ПоказатьСотрудников(ТекСтр.Ссылка); 
	КонецЕсли;  
	
	Элементы.СотрудникиКВыдаче.ТекстПодвала = Сотрудники.Итог("КВыдаче");
	Элементы.СотрудникиВыдано.ТекстПодвала = Сотрудники.Итог("Выдано");

КонецПроцедуры  

Процедура ПоказатьСотрудников(Ведомость)
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ВедомостиРКОПоЗарплатеСотрудники.Сотрудник КАК Сотрудник,
		               |	ЛБ_ВедомостиРКОПоЗарплатеСотрудники.СуммаКВыплате КАК КВыдаче,
		               |	ЛБ_ВедомостиРКОПоЗарплатеСотрудники.Ссылка.Отделение КАК Отделение,
		               |	ВЫБОР
		               |		КОГДА ВложенныйЗапрос.Ссылка.Проведен
		               |			ТОГДА ВложенныйЗапрос.Сумма
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Выдано,
		               |	ВЫБОР
		               |		КОГДА НЕ ВложенныйЗапрос.Ссылка.ПометкаУдаления
		               |			ТОГДА ВложенныйЗапрос.Ссылка
		               |	КОНЕЦ КАК РКО,
		               |	ВЫБОР
		               |		КОГДА НЕ ВложенныйЗапрос.Ссылка.ПометкаУдаления
		               |			ТОГДА ВложенныйЗапрос.Ссылка.Дата
		               |	КОНЕЦ КАК Дата,
		               |	ВЫБОР
		               |		КОГДА ВложенныйЗапрос.Ссылка.Проведен
		               |			ТОГДА ВложенныйЗапрос.Ссылка.Ответственный
		               |	КОНЕЦ КАК Кассир,
		               |	ВЫБОР
		               |		КОГДА ВложенныйЗапрос.Ссылка.Проведен
		               |			ТОГДА ВложенныйЗапрос.Ссылка.ДУЛ
		               |	КОНЕЦ КАК ПаспортныеДанные,
		               |	ВЫБОР
		               |		КОГДА НЕ ВложенныйЗапрос.Ссылка.ПометкаУдаления
		               |			ТОГДА ВложенныйЗапрос.Ломбард
		               |	КОНЕЦ КАК Ломбард,
		               |	ВЫБОР
		               |		КОГДА ВложенныйЗапрос.Ссылка.Проведен
		               |			ТОГДА &СтатусРКОВыплата
		               |		КОГДА НЕ ВложенныйЗапрос.Ссылка.Проведен
		               |				И НЕ ВложенныйЗапрос.Ссылка.ПометкаУдаления
		               |			ТОГДА &СтатусРКООтправлено
		               |		ИНАЧЕ &СтатусРКОПроект
		               |	КОНЕЦ КАК Статус,
		               |	ВложенныйЗапрос.Ответственный КАК Ответственный
		               |ИЗ
		               |	Документ.ЛБ_ВедомостьРКОПоЗарплате.Сотрудники КАК ЛБ_ВедомостиРКОПоЗарплатеСотрудники
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЛБ_РасходныйКассовыйОрдер.Ссылка КАК Ссылка,
		               |			ЛБ_РасходныйКассовыйОрдер.Контрагент КАК Контрагент,
		               |			ЛБ_РасходныйКассовыйОрдер.Проведен КАК Проведен,
		               |			ЛБ_РасходныйКассовыйОрдер.Ломбард КАК Ломбард,
		               |			ЛБ_РасходныйКассовыйОрдер.Сумма КАК Сумма,
		               |			ЛБ_РасходныйКассовыйОрдер.ВедомостьЗП КАК ВедомостьЗП,
		               |			ВЫБОР
		               |				КОГДА ЛБ_РасходныйКассовыйОрдер.Проведен
		               |					ТОГДА ЛБ_РасходныйКассовыйОрдер.Ответственный
		               |				ИНАЧЕ ЛБ_РасходныйКассовыйОрдер.КтоОтправилВЛомбард
		               |			КОНЕЦ КАК Ответственный
		               |		ИЗ
		               |			Документ.ЛБ_РасходныйКассовыйОрдер КАК ЛБ_РасходныйКассовыйОрдер
		               |		ГДЕ
		               |			ЛБ_РасходныйКассовыйОрдер.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
		               |		ПО ЛБ_ВедомостиРКОПоЗарплатеСотрудники.Ссылка = ВложенныйЗапрос.ВедомостьЗП
		               |			И ЛБ_ВедомостиРКОПоЗарплатеСотрудники.Сотрудник.ФизическоеЛицо = ВложенныйЗапрос.Контрагент
		               |ГДЕ
		               |	ЛБ_ВедомостиРКОПоЗарплатеСотрудники.Ссылка = &Ссылка";
	
		Запрос.УстановитьПараметр("Ссылка", Ведомость);
		Запрос.УстановитьПараметр("СтатусРКОВыплата", Перечисления.ЛБ_СтатусыВедомостиПоЗарплате.Выплата);
		Запрос.УстановитьПараметр("СтатусРКООтправлено", Перечисления.ЛБ_СтатусыВедомостиПоЗарплате.Отправлено);
		Запрос.УстановитьПараметр("СтатусРКОПроект", Перечисления.ЛБ_СтатусыВедомостиПоЗарплате.Проект);
		
		тз = Запрос.Выполнить().Выгрузить(); 
		
		ЗначениеВРеквизитФормы(ТЗ, "Сотрудники"); 
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененРКОПоВедомости" Тогда
		Элементы.Список.Обновить();
		ОбновитьСотрудников();   
		ПолучитьСуммыСпискаНаСервере();

	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Отправить.Видимость = Ложь;
	Элементы.ОтменитьОтправку.Видимость = Ложь;
	Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
	Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
		Элементы.ФормаКоманднаяПанель.Видимость = Истина;
	КонецЕсли;	
	Если Пользователь_ЭтоЛомбард() Тогда		
		Отделение = ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДата(), ПараметрыСеанса.ТекущийЛомбард);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Отделение", Отделение, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Элементы.Отделение.Доступность = Ложь;     
		
		ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник;  
		ТекДата = ТекущаяДата();
		
		Если 	ЛБ_ОбщегоНазначения.СотрудникЯвляетсяНачальникомОтделения(ТекущийСотрудник, Текдата) или
				ЛБ_ОбщегоНазначения.СотрудникЯвляетсяЗаместителемНО(ТекущийСотрудник, Текдата) или
		 		ЛБ_ОбщегоНазначения.СотрудникЯвляетсяУправляющимЛомбарда(ТекущийСотрудник, Текдата) Тогда

				Элементы.Отправить.Видимость = Истина;
				Элементы.ОтменитьОтправку.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


Функция Пользователь_ЭтоЛомбард() 
	Возврат ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард;		
КонецФункции

&НаКлиенте
Процедура ВыбПериод(Команда)
	Диалог 					= Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период 			= Новый СтандартныйПериод(НачПериода, КонПериода);        
    ОписаниеОповещенияОЗакрытииФормы 	= Новый ОписаниеОповещения("ВыполнитьПослеВыбораПериода", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещенияОЗакрытииФормы);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораПериода(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		НачПериода 	= Результат.ДатаНачала;
        КонПериода 	= Результат.ДатаОкончания;  
		
		Элементы.Список.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Элементы.Список.Период.ДатаНачала = НачПериода;
		Элементы.Список.Период.ДатаОкончания = КонПериода;
		Элементы.Список.Обновить();
		
		ПолучитьСуммыСпискаНаСервере();

	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить(); 
	ПолучитьСуммыСпискаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекДата = ТекущаяДата();
	
	
	НачПериода 	= НачалоМесяца(ДобавитьМесяц(ТекДата, -1));
    КонПериода 	= КонецМесяца(ТекДата);  
		
	Элементы.Список.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Элементы.Список.Период.ДатаНачала    = НачПериода;
	Элементы.Список.Период.ДатаОкончания = КонПериода;
	Элементы.Список.Обновить();   
	
	ПолучитьСуммыСпискаНаСервере();


КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПоДате() 
	Элементы.Список.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Элементы.Список.Период.ДатаНачала    = НачПериода;
	Элементы.Список.Период.ДатаОкончания = КонПериода;
	Элементы.Список.Обновить();
	ПолучитьСуммыСпискаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура НачПериодаПриИзменении(Элемент)
	ОбновитьСписокПоДате();
КонецПроцедуры

&НаКлиенте
Процедура КонПериодаПриИзменении(Элемент)
	ОбновитьСписокПоДате();
КонецПроцедуры

 

&НаСервере
Процедура ПолучитьСуммыСпискаНаСервере()
    Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ТаблицаЗначений = Новый ТаблицаЗначений;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Элементы.СписокСуммаДокумента.ТекстПодвала = ТаблицаЗначений.Итог("СуммаДокумента");
	Элементы.СуммаВыплаты.ТекстПодвала = ТаблицаЗначений.Итог("СуммаВыплаты");


КонецПроцедуры
